#Work as SQL
import pandas as pd
import sqlite3

In [59]:
import pandas as pd 
import sqlite3

In [112]:
#read the CSV
df = pd.read_csv('./data/casoscovid19.csv')
#connect to a database
conn = sqlite3.connect("casoscovid19.db") #if the db does not exist, this creates a Any_Database_Name.db file in the current directory
#store your table in the database:


cursor = conn.cursor()
#Doping EMPLOYEE table if already exists
cursor.execute("DROP TABLE IF EXISTS test_0")
#print("Table dropped... ")
#Commit your changes in the database
conn.commit()
#Closing the connection
#conn.close()
# https://www.tutorialspoint.com/python_sqlite/python_sqlite_drop_table.htm

#gg = pd.read_sql('DROP TABLE IF EXISTS test_0;', conn)
#pd.read_sql_query('DROP TABLE IF EXISTS test_0;', conn)
df.to_sql('test_0', conn)

In [89]:
#connect to a database
conn = sqlite3.connect("casoscovid19.db") 
#if the db does not exist, this creates a Any_Database_Name.db file in the current directory

In [113]:
#read a SQL Query out of your database and into a pandas dataframe
sql_string = 'SELECT * FROM test_0'
sql_string = 'SELECT COUNT(*) FROM test_0 WHERE clasificacion LIKE "%Caso confirmado%";'
gg = pd.read_sql(sql_string, conn)
gg

   COUNT(*)
0    228173

In [63]:
#read a SQL Query out of your database and into a pandas dataframe
sql_string = 'SELECT * FROM test_0 LIMIT 5;'
gg = pd.read_sql(sql_string, conn)
gg

,index,id_evento_caso,sexo,edad,edad_años_meses,residencia_pais_nombre,residencia_provincia_nombre,residencia_departamento_nombre,carga_provincia_nombre,fecha_inicio_sintomas,...,fecha_fallecimiento,asistencia_respiratoria_mecanica,carga_provincia_id,origen_financiamiento,clasificacion,clasificacion_resumen,residencia_provincia_id,fecha_diagnostico,residencia_departamento_id,ultima_actualizacion
0,0,1000000,M,53.0,Años,Argentina,CABA,SIN ESPECIFICAR,Buenos Aires,None,...,None,NO,6.0,Privado,Caso Descartado,Descartado,2.0,2020-06-09,0.0,2020-08-05
1,1,1000002,M,21.0,Años,Argentina,Buenos Aires,La Matanza,Buenos Aires,None,...,None,NO,6.0,Público,Caso Descartado,Descartado,6.0,2020-06-01,427.0,2020-08-05
2,2,1000003,F,40.0,Años,Argentina,Córdoba,Capital,Córdoba,2020-05-24,...,None,NO,14.0,Privado,Caso Descartado,Descartado,14.0,2020-06-01,14.0,2020-08-05
3,3,1000005,F,58.0,Años,Argentina,Mendoza,Las Heras,Mendoza,None,...,None,NO,50.0,Público,Caso Descartado,Descartado,50.0,2020-06-01,49.0,2020-08-05
4,4,1000006,M,28.0,Años,Argentina,Buenos Aires,Malvinas Argentinas,Buenos Aires,2020-05-30,...,None,NO,6.0,Público,Caso sospechoso - Con muestra sin resultado,Sospechoso,6.0,None,515.0,2020-08-05

In [64]:
# ultima_actualizacion

In [114]:
sql_string = 'SELECT DISTINCT residencia_departamento_nombre FROM test_0 WHERE residencia_provincia_nombre="Buenos Aires";'
gg = pd.read_sql(sql_string, conn)
gg

    residencia_departamento_nombre
0                       La Matanza
1              Malvinas Argentinas
2               Esteban Echeverría
3                            Tigre
4                  Tres de Febrero
..                             ...
131                       Tapalqué
132                     Pellegrini
133                  General Guido
134                       Tordillo
135                        Capital

[136 rows x 1 columns]

In [66]:
sql_string = 'SELECT DISTINCT residencia_departamento_nombre FROM test_0 WHERE residencia_provincia_nombre="Buenos Aires";'
sql_string = 'select residencia_departamento_nombre, count(*) from test_0 WHERE residencia_provincia_nombre="Buenos Aires" AND clasificacion_resumen="Confirmado" group by residencia_departamento_nombre;'
gg = pd.read_sql(sql_string, conn)
gg

    residencia_departamento_nombre  count(*)
0                       25 de Mayo        34
1                       9 de Julio        18
2                    Adolfo Alsina         2
3           Adolfo Gonzales Chaves         1
4                          Alberti        12
..                             ...       ...
125                Tres de Febrero      4812
126                  Vicente López      2222
127                   Villa Gesell         8
128                      Villarino        11
129                         Zárate       442

[130 rows x 2 columns]

In [67]:
sql_string = 'SELECT DISTINCT residencia_departamento_nombre FROM test_0 WHERE residencia_provincia_nombre="Buenos Aires";'
gg = pd.read_sql(sql_string, conn)
gg

    residencia_departamento_nombre
0                       La Matanza
1              Malvinas Argentinas
2               Esteban Echeverría
3                            Tigre
4                  Tres de Febrero
..                             ...
131                       Tapalqué
132                     Pellegrini
133                  General Guido
134                       Tordillo
135                        Capital

[136 rows x 1 columns]

In [68]:
sql_string = 'select residencia_departamento_nombre, count(*) from test_0 WHERE residencia_provincia_nombre="Buenos Aires" group by residencia_departamento_nombre;'
gg = pd.read_sql(sql_string, conn)
gg

    residencia_departamento_nombre  count(*)
0                       25 de Mayo       166
1                       9 de Julio       233
2                    Adolfo Alsina        30
3           Adolfo Gonzales Chaves        32
4                          Alberti       134
..                             ...       ...
131                Tres de Febrero     12561
132                  Vicente López      7125
133                   Villa Gesell       115
134                      Villarino        94
135                         Zárate      1995

[136 rows x 2 columns]

In [69]:
sql_string = 'SELECT residencia_departamento_nombre, count(*) FROM test_0 WHERE (residencia_provincia_nombre="Buenos Aires"  AND clasificacion_resumen="Confirmado") group by residencia_departamento_nombre;'
gg = pd.read_sql(sql_string, conn)
gg

    residencia_departamento_nombre  count(*)
0                       25 de Mayo        34
1                       9 de Julio        18
2                    Adolfo Alsina         2
3           Adolfo Gonzales Chaves         1
4                          Alberti        12
..                             ...       ...
125                Tres de Febrero      4812
126                  Vicente López      2222
127                   Villa Gesell         8
128                      Villarino        11
129                         Zárate       442

[130 rows x 2 columns]

In [70]:
# casos por provincia
sql_string = 'SELECT residencia_provincia_nombre, count(*) FROM test_0 WHERE (clasificacion_resumen="Confirmado") group by residencia_provincia_nombre;'
#sql_string = 'SELECT carga_provincia_nombre, count(*) FROM test_0 WHERE (clasificacion_resumen="Confirmado") group by carga_provincia_nombre;'
gg = pd.read_sql(sql_string, conn)
gg

   residencia_provincia_nombre  count(*)
0                 Buenos Aires    128433
1                         CABA     58205
2                    Catamarca        60
3                        Chaco      3381
4                       Chubut       295
5                   Corrientes       157
6                      Córdoba      2733
7                   Entre Ríos       935
8                      Formosa        71
9                        Jujuy      2881
10                    La Pampa       165
11                    La Rioja       400
12                     Mendoza      1655
13                    Misiones        48
14                     Neuquén      1298
15                   Río Negro      2311
16             SIN ESPECIFICAR      1249
17                       Salta       361
18                    San Juan        21
19                    San Luis        33
20                  Santa Cruz       613
21                    Santa Fe      1616
22         Santiago del Estero        62
23            Tierra del Fuego       733
24                     Tucumán       315

In [103]:
sql_string = 'SELECT count(*) FROM test_0 WHERE (clasificacion_resumen="Confirmado");'
gg = pd.read_sql(sql_string, conn)
gg

   count(*)
0    208031

In [72]:
sql_string = 'SELECT DISTINCT residencia_departamento_nombre FROM test_0 WHERE residencia_provincia_nombre="Buenos Aires";'
sql_string = 'select residencia_departamento_nombre, count(*) from test_0 WHERE (clasificacion_resumen="Confirmado" AND residencia_provincia_nombre="Buenos Aires") group by residencia_departamento_nombre;'
gg = pd.read_sql(sql_string, conn)
gg

    residencia_departamento_nombre  count(*)
0                       25 de Mayo        34
1                       9 de Julio        18
2                    Adolfo Alsina         2
3           Adolfo Gonzales Chaves         1
4                          Alberti        12
..                             ...       ...
125                Tres de Febrero      4812
126                  Vicente López      2222
127                   Villa Gesell         8
128                      Villarino        11
129                         Zárate       442

[130 rows x 2 columns]

In [73]:
# muertes por departamento
sql_string = 'select residencia_departamento_nombre, count(*) from test_0 WHERE (clasificacion="Caso confirmado - Fallecido" AND residencia_provincia_nombre="Buenos Aires") group by residencia_departamento_nombre;'
gg = pd.read_sql(sql_string, conn)
gg

   residencia_departamento_nombre  count(*)
0                      9 de Julio         1
1                 Almirante Brown        70
2                      Avellaneda        89
3                        Ayacucho         1
4                            Azul         1
..                            ...       ...
65                    San Vicente         8
66                          Tigre        45
67                Tres de Febrero        89
68                  Vicente López        46
69                         Zárate         6

[70 rows x 2 columns]

In [90]:
# muertes por provincia
sql_string = 'select residencia_provincia_nombre, count(*) from test_0 WHERE (clasificacion="Caso confirmado - Fallecido") group by residencia_provincia_nombre;'
gg = pd.read_sql(sql_string, conn)
gg

   residencia_provincia_nombre  count(*)
0                 Buenos Aires      2054
1                         CABA      1190
2                        Chaco       114
3                       Chubut         2
4                   Corrientes         2
5                      Córdoba        49
6                   Entre Ríos        11
7                        Jujuy        30
8                     La Rioja        17
9                      Mendoza        46
10                    Misiones         2
11                     Neuquén        26
12                   Río Negro        73
13             SIN ESPECIFICAR         3
14                       Salta         2
15                  Santa Cruz         3
16                    Santa Fe        17
17            Tierra del Fuego         1
18                     Tucumán         4

In [93]:
# https://www.geeksforgeeks.org/python-filtering-data-with-pandas-query-method/
# importing pandas package 
import pandas as pd 
  
# making data frame from csv file  
data = pd.read_csv("./data/casoscovid19.csv") 
  
# replacing blank spaces with '_'  
data.columns =[column.replace(" ", "_") for column in data.columns] 
  
# filtering with query method 
#print(len(data.query('clasificacion_resumen =="Confirmado"', inplace = True)))
print(len(data.query('clasificacion_resumen =="Confirmado"')))
# display 
#data

228173

In [92]:
pip install -U pandasql

Note: you may need to restart the kernel to use updated packages.
'C:\Program' is not recognized as an internal or external command,
operable program or batch file.

In [76]:
# https://stackoverflow.com/questions/30530663/how-to-select-distinct-across-multiple-data-frame-columns-in-pandas
# https://riptutorial.com/pandas/example/26077/select-distinct-rows-across-dataframe
# data = pd.read_csv("./data/casoscovid19.csv") 

# from pandasql import sqldf
# q="""SELECT DISTINCT col1, col2 FROM df;"""
# pysqldf = lambda q: sqldf(q, globals())
# data = pysqldf(q)

In [120]:
# table argentina
# Provincia	Casos Confirmados Totales	Recuperados	Fallecidos
sql_string = '''SELECT count(*) AS Total,
    sum(case when clasificacion_resumen="Confirmado" then 1 else 0 end) AS Confirmados,
    sum(case when clasificacion LIKE "%No Activo%" then 1 else 0 end) AS Recuperados,
    sum(case when clasificacion = "Caso confirmado - Fallecido" then 1 else 0 end) AS Fallecidos
FROM test_0;
'''
gg = pd.read_sql(sql_string, conn)
gg

    Total  Confirmados  Recuperados  Fallecidos
0  773272       228173       103284        4252

In [118]:
# table provincias
# Provincia	Casos Confirmados Totales	Recuperados	Fallecidos
sql_string = '''SELECT residencia_provincia_nombre  AS Provincia,
    count(*) AS Total,
    sum(case when clasificacion_resumen="Confirmado" then 1 else 0 end) AS Confirmados,
    sum(case when clasificacion LIKE "%No Activo%" then 1 else 0 end) AS Recuperados,
    sum(case when clasificacion = "Caso confirmado - Fallecido" then 1 else 0 end) AS Fallecidos
FROM test_0
GROUP BY residencia_provincia_nombre;
'''
gg = pd.read_sql(sql_string, conn)
gg

              Provincia   Total  Confirmados  Recuperados  Fallecidos
0          Buenos Aires  413892       138322        68677        2370
1                  CABA  177414        66454        24220        1408
2             Catamarca    2204           60           50           0
3                 Chaco   25304         3872         2866         159
4                Chubut    3471          308          174           3
5            Corrientes    4865          200          120           2
6               Córdoba   35982         2994          649          52
7            Entre Ríos    5811          999          693          11
8               Formosa     904           81           77           0
9                 Jujuy   15122         2957          317          31
10             La Pampa    1611          170           72           0
11             La Rioja    4371          449          206          18
12              Mendoza    9041         1791          532          49
13             Misiones    2391           52           39           2
14              Neuquén    5250         1376          968          28
15            Río Negro    8939         2666         1135          81
16      SIN ESPECIFICAR    3247         1317          520           4
17                Salta    2399          411          169           2
18             San Juan    1106           22           17           0
19             San Luis     934           32           14           0
20           Santa Cruz    1715          635          310           4
21             Santa Fe   23761         1778          846          18
22  Santiago del Estero    5808           78           36           0
23     Tierra del Fuego    3612          801          425           5
24              Tucumán   14118          348          152           5

In [117]:
# table departamentos buenos aires
# Provincia	Casos Confirmados Totales	Recuperados	Fallecidos
sql_string = '''SELECT residencia_departamento_nombre  AS Residencia,
    count(*) AS Total,
    sum(case when clasificacion_resumen="Confirmado" then 1 else 0 end) AS Confirmados,
    sum(case when clasificacion LIKE "%No Activo%" then 1 else 0 end) AS Recuperados,
    sum(case when clasificacion = "Caso confirmado - Fallecido" then 1 else 0 end) AS Fallecidos
FROM test_0
WHERE (residencia_provincia_nombre="Buenos Aires")
GROUP BY residencia_departamento_nombre;
'''
gg = pd.read_sql(sql_string, conn)
gg

                 Residencia  Total  Confirmados  Recuperados  Fallecidos
0                25 de Mayo    199           36           23           0
1                9 de Julio    287           21           14           1
2             Adolfo Alsina     35            2            2           0
3    Adolfo Gonzales Chaves     36            1            0           0
4                   Alberti    158           12            7           0
..                      ...    ...          ...          ...         ...
131         Tres de Febrero  13810         5110         2526         107
132           Vicente López   8028         2371         1027          55
133            Villa Gesell    160            9            6           0
134               Villarino    127           19           16           0
135                  Zárate   2198          475          325           7

[136 rows x 5 columns]

In [116]:
# table departamentos buenos aires
# Provincia	Casos Confirmados Totales	Recuperados	Fallecidos
sql_string = '''
SELECT fecha_apertura, count(*) FROM test_0 WHERE (clasificacion_resumen="Confirmado") group by fecha_apertura  ORDER BY "fecha_apertura" DESC LIMIT 7;
'''
gg = pd.read_sql(sql_string, conn)
gg

  fecha_apertura  count(*)
0     2020-08-06      1598
1     2020-08-05      3110
2     2020-08-04      5656
3     2020-08-03      5641
4     2020-08-02      3934
5     2020-08-01      3948
6     2020-07-31      5756